export const updateLog = [
    {
      time: '2021-06-04',
      v: '3.0',
      log: `
        <div>- 支持Eval类型；</div>
        <div>- 支持一键复制/粘贴全部映射结构，优化一键复制/粘贴；</div>
        <div>- 支持常量类型的空格输入；</div>
        <div>- 新增RULE逻辑展示；</div>
      `
    },
    {
      time: '2021-04-22',
      v: '2.9',
      log: `
        <div>- 支持pcw-api内部调用；</div>
        <div>- 优化key值带小数点的对象取值；</div>
        <div>- 支持附加参数（不传入请求）；</div>
        <div>- 批量请求自动携带标识参数；</div>
        <div>- 新增一些规则（通用跳转规则/时间戳转换年月日/评分等）和签名（点赞等）；</div>
        <div>- RULE规则优化为下拉框选择；</div>
      `
    },
    {
      time: '2021-03-24',
      v: '2.8',
      log: `
        <div>- 数组转对象（A2O）支持多值；</div>
        <div>- 支持字符串分割；</div>
        <div>- 修复滚动条消失UI问题；</div>
      `
    },
    {
      time: '2021-03-18',
      v: '2.7',
      log: `
        <div>- 支持设置POST请求-ContentType；</div>
        <div>- 支持时间戳转换/万/日期等；</div>
        <div>- 修复四则运算/数组排序/A2O过滤计算等问题；</div>
      `
    },
    {
      time: '2021-02-25',
      v: '2.6',
      log: `
        <div>- 支持映射后数据处理，解决跨数据源间的计算处理问题；</div>
        <div>- 支持数据清扫，可去除无用数据节点；</div>
      `
    },
    {
      time: '2021-02-22',
      v: '2.5',
      log: `
        <div>- 支持JSON字符串Parse；</div>
        <div>- 支持Index、序号、输入参数等节点输入类型；</div>
        <div>- 支持全局映射节点；</div>
        <div>- 支持自定义聚合对象（X2O）；</div>
        <div>- 支持自定义奇谱ID融合奇谱数据，支持记忆功能；</div>
        <div>- 支持URL处理类型（图片尺寸拼接&校验、去除协议名等）；</div>
      `
    },
    {
      time: '2021-02-07',
      v: '2.4',
      log: `
        <div>- 数组过滤支持读取子级节点奇谱数据；</div>
        <div>- KV2V类型映射支持通配符；</div>
        <div>- 支持常量对象输入；</div>
        <div>- 支持附加继承值；</div>
        <div>- 支持A2O数组添加约束条件；</div>
        <div>- 支持映射后的数组排序；</div>
      `
    },
    {
      time: '2021-01-28',
      v: '2.3',
      log: `
        <div>- 支持映射节点顺序互换；</div>
        <div>- 支持继承参数的多组输入；</div>
        <div>- 支持批量请求的签名校验；</div>
        <div>- 奇谱数据支持播单/直播/快速专题等数据；</div>
        <div>- 修复批量/数组切换 & 必/选填行高显示问题</div>
      `
    },
    {
      time: '2021-01-21',
      v: '2.2',
      log: `
        <div>- 增加时间戳约束条件类型，增加日期转换等通用规则；</div>
        <div>- 增加url_encode配置开关，兼容中文参数；</div>
        <div>- 优化输入框，针对输入值进行trim；</div>
      `
    },
    {
      time: '2021-01-13',
      v: '2.1',
      log: `
        <div>- 增加只读权限；</div>
        <div>- 增加示例展示；</div>
        <div>- 请求参数支持文件类型；</div>
        <div>- 支持参数必填/选填配置&校验；</div>
      `
    },
    {
      time: '2020-12-28',
      v: '2.0',
      log: `
        <div>- 优化奇谱数据配置，支持尺寸控制；</div>
        <div>- 奇谱ID配置支持可视化选取；</div>
        <div>- 继承参数配置支持可视化选取；</div>
      `
    },
    {
      time: '2020-12-18',
      v: '1.9',
      log: `
        <div>- 优化预览数据展示，支持树状折叠；</div>
        <div>- 支持映射节点可视化选取；</div>
        <div>- 支持乐高资源位预览数据；</div>
      `
    },
    {
      time: '2020-12-15',
      v: '1.8',
      log: `
        <div>- 优化映射展示，新增折叠生成映射树；</div>
        <div>- 优化数据源展示，支持折叠数据源配置；</div>
        <div>- 拆分映射输入和映射输出组件；</div>
      `
    },
    {
      time: '2020-10-19',
      v: '1.7',
      log: `
        <div>- 新增支持数据源请求条件校验；</div>
        <div>- 新增支持数组扁平化输出；</div>
        <div>- 新增支持KV数组单值（KV2V）输入类型；</div>
        <div>- 新增支持按多个输入类型参数进行模块级缓存；</div>
        <div>- 新增支持展示预览数据源接口列表（请求地址&请求耗时）；</div>
        <div>- 新增Data类型模块，隐藏数据模块部分配置项；</div>
      `
    },
    {
      time: '2020-10-13',
      v: '1.6',
      log: `
        <div>- 新增支持模块内子级属性一键复制/粘贴；</div>
        <div>- 新增支持同数据源批量请求；</div>
        <div>- 新增支持星期/月份/年份计算规则；</div>
        <div>- 修复预览时继承参数因数据源id缺失获取失败问题；</div>
        <div>- 修复格式化继承参数重复转化问题；</div>
        <div>- 更新图标；</div>
      `
    },
    {
      time: '2020-10-09',
      v: '1.5',
      log: `
        <div>- 约束条件非必要时自动隐藏；</div>
        <div>- 模块ID强制规范，增加模块频道筛选；</div>
        <div>- 新增支持参数类型：签名，时间戳类型；</div>
        <div>- 优化多维数组映射方式；</div>
      `
    },
    {
      time: '2020-09-23',
      v: '1.4',
      log: `
        <div>- 修复一键导入及回滚相关BUG；</div>
        <div>- 新增支持KV数组转化为对象的计算规则；</div>
        <div>- 新增支持数组过滤器；</div>
      `
    },
    {
      time: '2020-09-21',
      v: '1.3',
      log: `
        <div>- 模块ID增加强制格式，支持配置扩展；</div>
        <div>- 模块ID增加线上调用地址跳转，方便开发同学使用；</div>
      `
    },
    {
      time: '2020-08-25',
      v: '1.2',
      log: `
        <div>- 灰度系统接入天秤ABTEST；</div>
        <div>- 支持多灰度预览；</div>
        <div>- 增加数据源/模块提示信息；</div>
      `,
      icon: 'heart'
    },
    {
      time: '2020-08-20',
      v: '1.1',
      log: `
        <div>- 增加一键复制功能；</div>
        <div>- 增加参数类型：INPUT, REQID, UA, REFER；</div>
        <div>- 增加正则类型计算规则；</div>
        <div>- 增加接口配置：超时时间，请求方式(GET/POST)，Headers，Post Body等；</div>
        <div>- 接口级/模块级缓存配置；</div>
        <div>- 模块内接口阻塞级别配置；</div>
        <div>- 更为严格的校验规则；</div>
      `
    },
    {
      time: '2020-08-08',
      v: '1.0 - 我们呱呱坠地，出生了！'
    }
  ]